app/Controllers/DataAkun.php

    public function index()
    {
        // session();
        helper(['form']);
        $userModel = new UserModel();
        $data['users'] = $userModel->where('status', 1)->findAll();

        $groupModel = new GroupModel();

        foreach ($data['users'] as $row) {
            $dataRow['group'] = $groupModel->getGroupsForUser($row->id);
            $dataRow['row'] = $row;
            $data['row' . $row->id] = view('data_akun/row', $dataRow);
        }

        $data['groups'] = $groupModel->findAll();
---
SELECT *
FROM `users`
WHERE `status` = 1
AND `users`.`deleted_at` IS NULL
SELECT *
FROM `auth_groups`

                unlink('img/' . $this->request->getVar('fotoLama'));
            }

            $this->dataakunModel->save([
                'id' => $id,
                'email' => $this->request->getVar('email'),
                'fullname' => $this->request->getVar('fullname'),
                'jenis_kelamin' => $this->request->getVar('jenis_kelamin'),
                'alamat' => $this->request->getVar('alamat'),
                'username' => $this->request->getVar('username'),
                'password_hash' => Password::hash($this->request->getVar('password_hash')),
                'foto' => $namaFoto

            ]);
---
UPDATE `users` SET `email` = 'admin@gmail.com', `fullname` = 'Administrator', `jenis_kelamin` = '1', `alamat` = 'Madiun', `username` = 'admin', `password_hash` = '$2y$10$jxkfS08KzZ.cq9Oxaf00X.lc.cVHb5MTttGJUitXkgtcvcluriBO2', `foto` = 'default-avatar.jpg'
WHERE `users`.`id` IN ('13')