app/Models/DataKriteriaModel.php

SELECT *
FROM `kriteria`
ORDER BY `id_kriteria` ASC
---
    public function getKriteria($id_kriteria = false)
    {
        if ($id_kriteria == false) {
            return $this->orderBy('id_kriteria', 'asc')->findAll();

SELECT COUNT(*) AS `numrows`
FROM `kriteria`
---
    public function hitungKriteria()
    {
        $db = \Config\Database::connect();
        $query = $db->table('kriteria');
        $query->selectCount('id_kriteria');
        $result = $query->countAllResults();