app/Models/DataAlternatifModel.php

SELECT *
FROM `alternatif`
---
    public function getAlternatif($id_alternatif = false)
    {
        if ($id_alternatif == false) {
            return $this->findAll();

SELECT COUNT(*) AS `numrows`
FROM `alternatif`
---
    public function hitungAlternatifAll()
    {
        $db = \Config\Database::connect();
        $query = $db->table('alternatif');
        $query->selectCount('id_alternatif');
        $result = $query->countAllResults();