app/Models/DataMatrixModel.php

    public function joinMatrix($id_matrix = false)
    {
        if ($id_matrix == false) {
            $db      = \Config\Database::connect();
            $builder = $db->table('nilai_matrix');
            $builder->select('*');
            $builder->join('alternatif', 'alternatif.id_alternatif = nilai_matrix.id_alternatif');
            $builder->join('kriteria', 'kriteria.id_kriteria = nilai_matrix.id_kriteria');
            $query = $builder->get();
---
SELECT *
FROM `nilai_matrix`

    public function hitungMatrix()
    {
        $db = \Config\Database::connect();
        $query = $db->table('nilai_matrix');
        $query->selectCount('id_matrix');
        $result = $query->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `nilai_matrix`